Revit 2027 API
NumberingFormattedParameter.Separator Property
 Separators corresponding to the included parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Separator { get; set; }
Public Property Separator As String
	Get
	Set
public:
property String^ Separator {
	String^ get ();
	void set (String^ value);
}
member Separator : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
NumberingFormattedParameter Class
Autodesk.Revit.DB Namespace